# Extract

In [1]:
import pandas as pd
import json

from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from config import password

### Extract Questions Json to Pandas DataFrame

In [2]:
json_file = 'Resources/JEOPARDY_QUESTIONS1.json'

In [3]:
questions_df = pd.read_json(json_file)
questions_df

,category,air_date,question,value,answer,round,show_number
0,HISTORY,2004-12-31,"'For the last 8 years of his life, Galileo was...",$200,Copernicus,Jeopardy!,4680
1,ESPN's TOP 10 ALL-TIME ATHLETES,2004-12-31,'No. 2: 1912 Olympian; football star at Carlis...,$200,Jim Thorpe,Jeopardy!,4680
2,EVERYBODY TALKS ABOUT IT...,2004-12-31,'The city of Yuma in this state has a record a...,$200,Arizona,Jeopardy!,4680
3,THE COMPANY LINE,2004-12-31,"'In 1963, live on ""The Art Linkletter Show"", t...",$200,McDonald\'s,Jeopardy!,4680
4,EPITAPHS & TRIBUTES,2004-12-31,"'Signer of the Dec. of Indep., framer of the C...",$200,John Adams,Jeopardy!,4680
...,...,...,...,...,...,...,...
216925,RIDDLE ME THIS,2006-05-11,'This Puccini opera turns on the solution to 3...,$2000,Turandot,Double Jeopardy!,4999
216926,"""T"" BIRDS",2006-05-11,'In North America this term is properly applie...,$2000,a titmouse,Double Jeopardy!,4999
216927,AUTHORS IN THEIR YOUTH,2006-05-11,"'In Penny Lane, where this ""Hellraiser"" grew u...",$2000,Clive Barker,Double Jeopardy!,4999
216928,QUOTATIONS,2006-05-11,"'From Ft. Sill, Okla. he made the plea, Arizon...",$2000,Geronimo,Double Jeopardy!,4999
216929,HISTORIC NAMES,2006-05-11,'A silent movie title includes the last name o...,None,Grigori Alexandrovich Potemkin,Final Jeopardy!,4999

### Extract Questions CSV to Pandas DataFrame

In [4]:
questions_csv = 'Resources/questions.csv'

In [5]:
questions_df1 = pd.read_csv(questions_csv)
questions_df1

,game_id,season,round,row,column,category,value,question_text,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie
...,...,...,...,...,...,...,...,...,...
225764,1789,17,DJ,5.0,3.0,ON ITS WESTERN BORDER,2000,Bosnia-Herzegovina,Croatia
225765,1789,17,DJ,5.0,4.0,YOGA,2000,"Meaning ""coiled one"", this type of yoga concen...",Kundalini
225766,1789,17,DJ,5.0,5.0,MOVIE MICE,2000,A Greek chorus of mice sang & read the title c...,Babe
225767,1789,17,DJ,5.0,6.0,WORK IT!,2000,"If you're a dromedary camel, you can ""bust"" th...",Humps
225768,1789,17,final,NaN,NaN,final,-1,2 of the 4 flags flown on Mount Everest on May...,"(2 of) Great Britain, India, Nepal & the Unite..."

### Extract Final Results CSV to Pandas DataFrame

In [6]:
final_results_csv = 'Resources/final_results.csv'

In [7]:
final_results_df = pd.read_csv(final_results_csv)
final_results_df

,game_id,season,position,dj_score,wager,correct,coryat_score
0,5635,33,returning_champion,10000.0,3001.0,True,11000.0
1,5635,33,middle,12000.0,12000.0,False,12000.0
2,5635,33,right,13000.0,11001.0,False,15200.0
3,5634,33,returning_champion,14400.0,6801.0,True,9600.0
4,5634,33,middle,10600.0,10600.0,True,10600.0
...,...,...,...,...,...,...,...
12007,2493,16,middle,9000.0,1800.0,False,9300.0
12008,2493,16,right,8200.0,3200.0,False,8200.0
12009,2144,16,returning_champion,5200.0,0.0,True,5200.0
12010,2144,16,middle,3400.0,1801.0,True,3800.0
12011,2144,16,right,1900.0,1899.0,True,2400.0

### Extract Contestants CSV to Pandas DataFrame

In [8]:
contestants_csv = 'Resources/contestants.csv'

In [9]:
contestants_df = pd.read_csv(contestants_csv)
contestants_df

,player_id,player_first_name,player_last_name,hometown_city,hometown_state,occupation
0,11367,Seth,Madej,Los Angeles,California,a writer
1,11368,Rich,Steeves,Norwalk,Connecticut,a manager of commercial support content
2,11363,Ragavan,Ramsubramani,New York,New York,a financial analyst
3,11365,Laura,Spoelstra,San Jose,California,a library media center technician
4,11366,Erin,Wilson,Baltimore,Maryland,a professor
...,...,...,...,...,...,...
12007,4976,Davine,Scarlett,Miami,Florida,a 12-year-old
12008,4977,Robert,Arshonsky,Cincinnati,Ohio,a 12-year-old
12009,4310,Zach,Safford,Roswell,Georgia,an 11-year-old
12010,4311,Cassie,Hill,Merrick,New York,a 12-year-old
12011,4312,Nate,Austin,Kansas City,Kansas,a 12-year-old

# Transform

### Clean questions_df

In [10]:
# Check data types of the columns
questions_df.dtypes

category       object
air_date       object
question       object
value          object
answer         object
round          object
show_number     int64
dtype: object

In [11]:
# Rename 'show_number' column to 'game_id' to match other dataframes
questions_df = questions_df.rename(columns={"show_number": "game_id"})
questions_df.head()

,category,air_date,question,value,answer,round,game_id
0,HISTORY,2004-12-31,"'For the last 8 years of his life, Galileo was...",$200,Copernicus,Jeopardy!,4680
1,ESPN's TOP 10 ALL-TIME ATHLETES,2004-12-31,'No. 2: 1912 Olympian; football star at Carlis...,$200,Jim Thorpe,Jeopardy!,4680
2,EVERYBODY TALKS ABOUT IT...,2004-12-31,'The city of Yuma in this state has a record a...,$200,Arizona,Jeopardy!,4680
3,THE COMPANY LINE,2004-12-31,"'In 1963, live on ""The Art Linkletter Show"", t...",$200,McDonald\'s,Jeopardy!,4680
4,EPITAPHS & TRIBUTES,2004-12-31,"'Signer of the Dec. of Indep., framer of the C...",$200,John Adams,Jeopardy!,4680

In [12]:
# Reorder columns so game_id is first and column order makes sense (round before air_date before category, round before category, category before question)
questions_df = questions_df[['game_id', 'air_date', 'round', 'category', 'question', 'value', 'answer']]
questions_df.head()

,game_id,air_date,round,category,question,value,answer
0,4680,2004-12-31,Jeopardy!,HISTORY,"'For the last 8 years of his life, Galileo was...",$200,Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,'No. 2: 1912 Olympian; football star at Carlis...,$200,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,'The city of Yuma in this state has a record a...,$200,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,"'In 1963, live on ""The Art Linkletter Show"", t...",$200,McDonald\'s
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,"'Signer of the Dec. of Indep., framer of the C...",$200,John Adams

In [13]:
# Change air_date datatype to timedate
questions_df['air_date'] = questions_df['air_date'].astype('datetime64')
questions_df.dtypes

game_id              int64
air_date    datetime64[ns]
round               object
category            object
question            object
value               object
answer              object
dtype: object

In [14]:
# Count the number of null values in each column
questions_df.isnull().sum()

game_id        0
air_date       0
round          0
category       0
question       0
value       3634
answer         0
dtype: int64

In [16]:
# Change 'none' to $0 in value column to replace null values
value_replace = {None: "$0"}
questions_df["value"].replace(value_replace, inplace=True)
questions_df

,game_id,air_date,round,category,question,value,answer
0,4680,2004-12-31,Jeopardy!,HISTORY,"'For the last 8 years of his life, Galileo was...",$200,Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,'No. 2: 1912 Olympian; football star at Carlis...,$200,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,'The city of Yuma in this state has a record a...,$200,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,"'In 1963, live on ""The Art Linkletter Show"", t...",$200,McDonald\'s
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,"'Signer of the Dec. of Indep., framer of the C...",$200,John Adams
...,...,...,...,...,...,...,...
216925,4999,2006-05-11,Double Jeopardy!,RIDDLE ME THIS,'This Puccini opera turns on the solution to 3...,$2000,Turandot
216926,4999,2006-05-11,Double Jeopardy!,"""T"" BIRDS",'In North America this term is properly applie...,$2000,a titmouse
216927,4999,2006-05-11,Double Jeopardy!,AUTHORS IN THEIR YOUTH,"'In Penny Lane, where this ""Hellraiser"" grew u...",$2000,Clive Barker
216928,4999,2006-05-11,Double Jeopardy!,QUOTATIONS,"'From Ft. Sill, Okla. he made the plea, Arizon...",$2000,Geronimo
216929,4999,2006-05-11,Final Jeopardy!,HISTORIC NAMES,'A silent movie title includes the last name o...,$0,Grigori Alexandrovich Potemkin

In [17]:
questions_df.count()

game_id     216930
air_date    216930
round       216930
category    216930
question    216930
value       216930
answer      216930
dtype: int64

In [19]:
questions_df.head()

,game_id,air_date,round,category,question,value,answer
0,4680,2004-12-31,Jeopardy!,HISTORY,"'For the last 8 years of his life, Galileo was...",$200,Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,'No. 2: 1912 Olympian; football star at Carlis...,$200,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,'The city of Yuma in this state has a record a...,$200,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,"'In 1963, live on ""The Art Linkletter Show"", t...",$200,McDonald\'s
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,"'Signer of the Dec. of Indep., framer of the C...",$200,John Adams

In [20]:
questions_df.dtypes

game_id              int64
air_date    datetime64[ns]
round               object
category            object
question            object
value               object
answer              object
dtype: object

### Clean questions1_df

In [21]:
# Check data types of the columns
questions_df1.dtypes

game_id            int64
season             int64
round             object
row              float64
column           float64
category          object
value              int64
question_text     object
answer            object
dtype: object

In [22]:
# Rename 'question_text' column to 'question' to match other dataframes
questions_df1 = questions_df1.rename(columns={"question_text": "question"})
questions_df1.head()

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie

In [23]:
# Replce the -1 in the value column to 0 to match other dataframes
value_replace1 = {-1:0}
questions_df1["value"].replace(value_replace1, inplace=True)
questions_df1

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie
...,...,...,...,...,...,...,...,...,...
225764,1789,17,DJ,5.0,3.0,ON ITS WESTERN BORDER,2000,Bosnia-Herzegovina,Croatia
225765,1789,17,DJ,5.0,4.0,YOGA,2000,"Meaning ""coiled one"", this type of yoga concen...",Kundalini
225766,1789,17,DJ,5.0,5.0,MOVIE MICE,2000,A Greek chorus of mice sang & read the title c...,Babe
225767,1789,17,DJ,5.0,6.0,WORK IT!,2000,"If you're a dromedary camel, you can ""bust"" th...",Humps
225768,1789,17,final,NaN,NaN,final,0,2 of the 4 flags flown on Mount Everest on May...,"(2 of) Great Britain, India, Nepal & the Unite..."

In [24]:
# Replace 'final' in the round column with 'F' to match the format of the rest of the column
round_replace = {'final':'F'}
questions_df1["round"].replace(round_replace, inplace=True)
questions_df1

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie
...,...,...,...,...,...,...,...,...,...
225764,1789,17,DJ,5.0,3.0,ON ITS WESTERN BORDER,2000,Bosnia-Herzegovina,Croatia
225765,1789,17,DJ,5.0,4.0,YOGA,2000,"Meaning ""coiled one"", this type of yoga concen...",Kundalini
225766,1789,17,DJ,5.0,5.0,MOVIE MICE,2000,A Greek chorus of mice sang & read the title c...,Babe
225767,1789,17,DJ,5.0,6.0,WORK IT!,2000,"If you're a dromedary camel, you can ""bust"" th...",Humps
225768,1789,17,F,NaN,NaN,final,0,2 of the 4 flags flown on Mount Everest on May...,"(2 of) Great Britain, India, Nepal & the Unite..."

In [25]:
# Replace 'final' in the category column with 'FINAL' to match the format of the rest of the column
round_replace1 = {'final':'FINAL JEOPARDY'}
questions_df1["category"].replace(round_replace1, inplace=True)
questions_df1

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie
...,...,...,...,...,...,...,...,...,...
225764,1789,17,DJ,5.0,3.0,ON ITS WESTERN BORDER,2000,Bosnia-Herzegovina,Croatia
225765,1789,17,DJ,5.0,4.0,YOGA,2000,"Meaning ""coiled one"", this type of yoga concen...",Kundalini
225766,1789,17,DJ,5.0,5.0,MOVIE MICE,2000,A Greek chorus of mice sang & read the title c...,Babe
225767,1789,17,DJ,5.0,6.0,WORK IT!,2000,"If you're a dromedary camel, you can ""bust"" th...",Humps
225768,1789,17,F,NaN,NaN,FINAL JEOPARDY,0,2 of the 4 flags flown on Mount Everest on May...,"(2 of) Great Britain, India, Nepal & the Unite..."

In [26]:
# Count the number of null values in each column
questions_df1.isnull().sum()

game_id        0
season         0
round          0
row         3781
column      3781
category       0
value          0
question       0
answer         2
dtype: int64

In [27]:
# Fill the null values in the row and column, columns with a 0 to reflect final jeopardy
questions_df1['column'].fillna(0, inplace = True)
questions_df1['row'].fillna(0, inplace = True)
questions_df1

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1.0,1.0,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1.0,2.0,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1.0,3.0,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1.0,4.0,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1.0,5.0,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie
...,...,...,...,...,...,...,...,...,...
225764,1789,17,DJ,5.0,3.0,ON ITS WESTERN BORDER,2000,Bosnia-Herzegovina,Croatia
225765,1789,17,DJ,5.0,4.0,YOGA,2000,"Meaning ""coiled one"", this type of yoga concen...",Kundalini
225766,1789,17,DJ,5.0,5.0,MOVIE MICE,2000,A Greek chorus of mice sang & read the title c...,Babe
225767,1789,17,DJ,5.0,6.0,WORK IT!,2000,"If you're a dromedary camel, you can ""bust"" th...",Humps
225768,1789,17,F,0.0,0.0,FINAL JEOPARDY,0,2 of the 4 flags flown on Mount Everest on May...,"(2 of) Great Britain, India, Nepal & the Unite..."

In [28]:
# Change the data type of the row and column columns from a float to an integer to remove unnecessary decimals 
questions_df1['row'] = questions_df1['row'].astype('int')
questions_df1['column'] = questions_df1['column'].astype('int')
questions_df1.head()

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1,1,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1,2,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1,3,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1,4,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1,5,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie

In [29]:
# Find any remaining rows with null data
questions_df1[questions_df1.isna().any(axis =1)]

,game_id,season,round,row,column,category,value,question,answer
79971,3677,27,DJ,1,6,NOTHING,400,"This word for ""nothing"" precedes ""and void"" to...",NaN
189426,2712,19,J,1,6,"GOING ""N""SANE",200,"It often precedes ""and void""",NaN

In [30]:
# Drop remaining rows with null data in the 'answer' column
questions_df1 = questions_df1.dropna(how = 'any')

In [31]:
questions_df1.count()

game_id     225767
season      225767
round       225767
row         225767
column      225767
category    225767
value       225767
question    225767
answer      225767
dtype: int64

In [32]:
questions_df1.head()

,game_id,season,round,row,column,category,value,question,answer
0,5638,33,J,1,1,GENIUS.,200,Dramatized here is the moment that led to the ...,the theory of relativity
1,5638,33,J,1,2,EDUCATIONAL FILMS,200,"As Ms. Norbury in ""Mean Girls"", she asked, ""Ho...",Tina Fey
2,5638,33,J,1,3,FIRST NAMES IN THE DICTIONARY,200,"Fashionable & high class, like Mr. Bennett",tony
3,5638,33,J,1,4,FOREIGN GEOGRAPHIC TERMS,200,In French: ile,an island
4,5638,33,J,1,5,SMALL ENOUGH TO FIT,200,This name for the little bodysuit with a snap ...,onesie

In [33]:
questions_df1.dtypes

game_id      int64
season       int64
round       object
row          int64
column       int64
category    object
value        int64
question    object
answer      object
dtype: object

### Clean final_results_df

In [34]:
# Check data types of the columns
final_results_df.dtypes

game_id           int64
season            int64
position         object
dj_score        float64
wager           float64
correct          object
coryat_score    float64
dtype: object

In [35]:
# Remove dj_score and coryat_score from dataframe since we do not have documentation on what these columns mean
final_results_cols = ['game_id', 'season', 'position', 'wager', 'correct']
final_results_df = final_results_df[final_results_cols]
final_results_df

       game_id  season            position    wager correct
0         5635      33  returning_champion   3001.0    True
1         5635      33              middle  12000.0   False
2         5635      33               right  11001.0   False
3         5634      33  returning_champion   6801.0    True
4         5634      33              middle  10600.0    True
...        ...     ...                 ...      ...     ...
12007     2493      16              middle   1800.0   False
12008     2493      16               right   3200.0   False
12009     2144      16  returning_champion      0.0    True
12010     2144      16              middle   1801.0    True
12011     2144      16               right   1899.0    True

[12012 rows x 5 columns]

In [36]:
# Count the number of null values in each column
final_results_df.isnull().sum()

game_id       0
season        0
position      0
wager       225
correct     225
dtype: int64

In [37]:
# Display the rows with null values in the 'wager' and 'correct' columns
final_results_df[final_results_df.isna().any(axis =1)]

       game_id  season            position  wager correct
72        5594      33  returning_champion    NaN     NaN
99        5569      33  returning_champion    NaN     NaN
139       5560      33              middle    NaN     NaN
142       5559      33              middle    NaN     NaN
146       5539      33               right    NaN     NaN
...        ...     ...                 ...    ...     ...
11778     2186      16  returning_champion    NaN     NaN
11791     2182      16              middle    NaN     NaN
11933     1626      16               right    NaN     NaN
11936     1625      16               right    NaN     NaN
11993     2040      16               right    NaN     NaN

[225 rows x 5 columns]

In [38]:
# Drop any row with N/A
final_results_df = final_results_df.dropna(how = 'any')
final_results_df

       game_id  season            position    wager correct
0         5635      33  returning_champion   3001.0    True
1         5635      33              middle  12000.0   False
2         5635      33               right  11001.0   False
3         5634      33  returning_champion   6801.0    True
4         5634      33              middle  10600.0    True
...        ...     ...                 ...      ...     ...
12007     2493      16              middle   1800.0   False
12008     2493      16               right   3200.0   False
12009     2144      16  returning_champion      0.0    True
12010     2144      16              middle   1801.0    True
12011     2144      16               right   1899.0    True

[11787 rows x 5 columns]

In [39]:
final_results_df['wager'] = final_results_df['wager'].astype('int')
final_results_df.dtypes

/Users/graceolson/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

game_id      int64
season       int64
position    object
wager        int64
correct     object
dtype: object

In [40]:
final_results_df.count()

game_id     11787
season      11787
position    11787
wager       11787
correct     11787
dtype: int64

In [42]:
final_results_df.head()

   game_id  season            position  wager correct
0     5635      33  returning_champion   3001    True
1     5635      33              middle  12000   False
2     5635      33               right  11001   False
3     5634      33  returning_champion   6801    True
4     5634      33              middle  10600    True

In [43]:
final_results_df.dtypes

game_id      int64
season       int64
position    object
wager        int64
correct     object
dtype: object

### Clean contestants_df

In [44]:
# Check data types of the columns
contestants_df.dtypes

player_id             int64
player_first_name    object
player_last_name     object
hometown_city        object
hometown_state       object
occupation           object
dtype: object

In [45]:
# Count the number of null values in each column
contestants_df.isnull().sum()

player_id              0
player_first_name      0
player_last_name       1
hometown_city        294
hometown_state       294
occupation            69
dtype: int64

In [46]:
# Display the rows with null values in all columns
contestants_df[contestants_df.isna().any(axis =1)]

,player_id,player_first_name,player_last_name,hometown_city,hometown_state,occupation
85,3692,Craig,Boge,NaN,NaN,a senior
661,10649,Matthew,Weiner,NaN,NaN,a series creator and executive producer
662,10650,David,Gregory,NaN,NaN,a political analyst and author
663,10651,Melissa,Harris-Perry,NaN,NaN,a professor and editor-at-large
664,10646,Sunny,Hostin,NaN,NaN,a senior legal correspondent and analyst
...,...,...,...,...,...,...
11857,4992,Epatha,S. Merkerson,NaN,NaN,NaN
11858,4993,Brian,Dennehy,NaN,NaN,NaN
11859,4968,Carol,Burnett,NaN,NaN,NaN
11860,4969,Noah,Wyle,NaN,NaN,NaN
11861,4970,Rosie,O'Donnell,NaN,NaN,NaN

In [47]:
# Drop any row with N/A 
contestants_df = contestants_df.dropna(how = 'any')
contestants_df

,player_id,player_first_name,player_last_name,hometown_city,hometown_state,occupation
0,11367,Seth,Madej,Los Angeles,California,a writer
1,11368,Rich,Steeves,Norwalk,Connecticut,a manager of commercial support content
2,11363,Ragavan,Ramsubramani,New York,New York,a financial analyst
3,11365,Laura,Spoelstra,San Jose,California,a library media center technician
4,11366,Erin,Wilson,Baltimore,Maryland,a professor
...,...,...,...,...,...,...
12007,4976,Davine,Scarlett,Miami,Florida,a 12-year-old
12008,4977,Robert,Arshonsky,Cincinnati,Ohio,a 12-year-old
12009,4310,Zach,Safford,Roswell,Georgia,an 11-year-old
12010,4311,Cassie,Hill,Merrick,New York,a 12-year-old
12011,4312,Nate,Austin,Kansas City,Kansas,a 12-year-old

In [48]:
contestants_df.count()

player_id            11665
player_first_name    11665
player_last_name     11665
hometown_city        11665
hometown_state       11665
occupation           11665
dtype: int64

In [49]:
contestants_df.head()

,player_id,player_first_name,player_last_name,hometown_city,hometown_state,occupation
0,11367,Seth,Madej,Los Angeles,California,a writer
1,11368,Rich,Steeves,Norwalk,Connecticut,a manager of commercial support content
2,11363,Ragavan,Ramsubramani,New York,New York,a financial analyst
3,11365,Laura,Spoelstra,San Jose,California,a library media center technician
4,11366,Erin,Wilson,Baltimore,Maryland,a professor

In [50]:
contestants_df.dtypes

player_id             int64
player_first_name    object
player_last_name     object
hometown_city        object
hometown_state       object
occupation           object
dtype: object

## Load

In [51]:
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/jeopardy_db')
if not database_exists(engine.url):
    create_database(engine.url)

print(database_exists(engine.url))

True

In [52]:
questions_df.to_sql('questions_00', con=engine, if_exists = 'append', index = False)

In [53]:
questions_df1.to_sql('questions_01', con=engine, if_exists = 'append', index = False)

In [54]:
final_results_df.to_sql('final_results', con=engine, if_exists = 'append', index = False)

In [55]:
contestants_df.to_sql('contestants', con=engine, if_exists = 'append', index = False)